package com.electronic.medicine.controllers;

import com.electronic.medicine.entity.Users;
import com.electronic.medicine.services.UserService;
import lombok.RequiredArgsConstructor;
import org.springframework.web.bind.annotation.CrossOrigin;
import org.springframework.web.bind.annotation.GetMapping;
import org.springframework.web.bind.annotation.RestController;

import java.util.List;

@RestController
@RequiredArgsConstructor
public class Head {

    private final UserService userService;

    private List<String> description = List.of(
            "Добро пожаловать на наш YouTube канал! Здесь мы делимся актуальными знаниями в области медицины, здоровья " +
                    "и профилактики болезней. Наши эксперты обсуждают самые важные темы, начиная от здорового образа " +
                    "жизни до новейших медицинских исследований. Подписывайтесь, чтобы быть в курсе и заботиться о " +
                    "своем здоровье!", "Оставайтесь в курсе последних новостей медицины, здоровья и wellness. Поделитесь" +
                    " опытом и задайте вопросы нашим специалистам. Мы публикуем актуальные статьи, советы по лечению, " +
                    "профилактике и здоровому образу жизни. Ваше здоровье – наша забота!", "Официальный сайт ВОЗ, в " +
                    "отличие от справочника MSD, не рассказывает детально о методах лечения. Задача ресурса — " +
                    "рассказывать о причинах заболеваний, путях передачи, эпидемиологии, симптомах, вспышках болезней, " +
                    "чрезвычайных ситуациях и об актуальных проблемах современной медицины, например, алкоголизме, " +
                    "гепатите, ВИЧ. Большинство статей переведены на русский язык, содержат статистику и " +
                    "распространенность заболеваний по странам.", "Содержит приказы, клинические протоколы ведения " +
                    "пациентов и стандарты оказания медицинской помощи, в которых содержится перечень диагностических и " +
                    "лечебных действий при различных патологиях. Однако есть минусы: стандарты подогнаны под " +
                    "среднестатического пациента, часто охватывают одновременно стандарты лечения взрослых и детей, " +
                    "информация давно не обновлялась.", "Британский медицинский журнал публикует статьи, результаты " +
                    "систематических обзоров и клинические исследования. Это один из наиболее цитируемых журналов. " +
                    "Цель издания — образование молодых врачей и медицинских сотрудников, которые недавно начали " +
                    "практиковать и борьба с недостоверной, неэтичной и устаревшей информацией."
    );

    @CrossOrigin
    @GetMapping("/description")
    public List<String> sayHello() {
        return description;
    }

    @CrossOrigin
    @GetMapping("/users")
    public List<Users> getUsers() {
        return userService.getAllUsers();
    }

}
